Функция СведенияОВнешнейОбработке() Экспорт
  
  ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке(СтандартныеПодсистемыСервер.ВерсияБиблиотеки());
  ПараметрыРегистрации.Наименование = ЭтотОбъект.Метаданные().Синоним;
  ПараметрыРегистрации.Версия = "1.0";
  ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
  ПараметрыРегистрации.Информация = ЭтотОбъект.Метаданные().Комментарий;
  ПараметрыРегистрации.БезопасныйРежим = Ложь;
  
  ПараметрыРегистрации.Разрешения.Добавить(РаботаВБезопасномРежиме.РазрешениеНаИспользованиеКаталогаВременныхФайлов(Истина,Истина,"Передача файла с клиента на сервер"));
  
  Команда = ПараметрыРегистрации.Команды.Добавить();
  Команда.Представление = НСтр("ru = '"+ЭтотОбъект.Метаданные().Синоним+"'");  
  Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
  Команда.Идентификатор = ЭтотОбъект.Метаданные().Имя;
  
  Возврат ПараметрыРегистрации;
  
КонецФункции